test/fixtures/fake_payment_link.json

{
    "accept_partial": true,
    "amount": 1000,
    "amount_paid": 0,
    "callback_method": "get",
    "callback_url": "https://example-callback-url.com/",
    "cancelled_at": 1647854430,
    "created_at": 1647850784,
    "currency": "INR",
    "customer": {
      "contact": "+919999999999",
      "email": "gaurav.kumar@example.com",
      "name": "Gaurav Kumar"
    },
    "description": "For XYZ purpose",
    "expire_by": 0,
    "expired_at": 0,
    "first_min_partial_amount": 100,
    "id": "plink_J9feMU9xqHQVWX",
    "notes": {
      "policy_name": "Jeevan Bima"
    },
    "notify": {
      "email": true,
      "sms": true
    },
    "payments": [
  
    ],
    "reference_id": "",
    "reminder_enable": true,
    "reminders": {
      "status": "in_progress"
    },
    "short_url": "https://rzp.io/i/GIgR3hfGI",
    "status": "cancelled",
    "updated_at": 1647854430,
    "upi_link": false,
    "user_id": ""
}
